Revit 2027 API
SolidOptions.ExtraFaceAndEdgeHistoryKey Property
 Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ExtraFaceAndEdgeHistoryKey { get; set; }
Public Property ExtraFaceAndEdgeHistoryKey As Integer
	Get
	Set
public:
property int ExtraFaceAndEdgeHistoryKey {
	int get ();
	void set (int value);
}
member ExtraFaceAndEdgeHistoryKey : int with get, set
Property Value
Int32
See Also
Reference
SolidOptions Class
Autodesk.Revit.DB Namespace